---
type: ViewActivatedEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# ViewActivatedEventArgs

`Autodesk.Revit.UI.Events.ViewActivatedEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CurrentActiveView | 2010 | `public View CurrentActiveView { get ; }` |
| Property | PreviousActiveView | 2010 | `public View PreviousActiveView { get ; }` |